### SQL Alchemy and Queries

In [5]:
from sqlalchemy import create_engine
import pandas as pd

In [12]:
# engine = create_engine("sqlite:///iris.sqlite")   # SQLite database named iris.sqlite in our working directory
engine = create_engine("sqlite:///:memory:") ## sqlite in memory

In [17]:
engine.execute('CREATE TABLE "data" ('
               'id INTEGER NOT NULL,'
               'name VARCHAR, '
               'PRIMARY KEY (id));')

In [22]:
# # insert a raw
engine.execute('INSERT INTO "data" '
               '(id, name) '
               'VALUES (2,"Bob")')

In [23]:
# select *
result = engine.execute('SELECT * FROM '
                        '"data"')
for _r in result:
   print(_r)

(1, 'John')
(2, 'Bob')

In [24]:
# delete *
engine.execute('DELETE from "data" where id=1;')
result = engine.execute('SELECT * FROM "data"')
print(result.fetchall())

[(2, 'Bob')]

In [25]:
query = "SELECT * FROM data"  # String containing the SQL query to select all rows
df = pd.read_sql_query(query, engine)  # Finally, importing the data into DataFrame df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1 non-null      int64
 1   name    1 non-null      object
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [29]:
with engine.connect() as conn, conn.begin():
    data = pd.read_sql_table("data", conn)

In [30]:
data

   id name
0   2  Bob

In [38]:
data.to_sql("data3", engine)

In [51]:
data.to_sql("data_chunke2", engine, chunksize=1000)

In [42]:
data

   id name
0   2  Bob

In [44]:
query = "SELECT * FROM data"  # String containing the SQL query
df = pd.read_sql_query(query, engine, index_col="id")  # Using the first column as indices
df.head()

   name
id
2   Bob

In [53]:
df

   name
id
2   Bob

In [58]:
 df.to_sql('data1', engine, method='multi',index=False, if_exists='replace')

In [64]:
pd.read_sql_query("SELECT * FROM data1", engine)

  name
0  Bob

In [60]:
data_df = pd.read_sql_table("data", engine)

In [61]:
data_df

  name
0  Bob